test.tex
\documentclass[11pt]{article}
\setCJKmainfont{FandolSong}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{osdijf oisjdfojsodij}
\hypersetup{
 pdfauthor={},
 pdftitle={osdijf oisjdfojsodij},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{baidu.com新技术革命}
\label{sec:orgheadline1}
\begin{center}
\begin{tabular}{ll}
sodijf新技术革命 & asdf 新技术革命\\
\hline
osidfjosdjfosdjfojsd & sdfjsdofdf\\
soidfjosjfooisdfjosdjf & oisjdfojsdiofjos\\
dsofijosdf & soaidfjosajdf osdifjsoidfj\\
\end{tabular}
\end{center}

\section{sdiofjosidjf新技术革命}
\label{sec:orgheadline2}
good for this新技术革命 manual.


The Org homepage\footnote{static website generator using node.} now looks a lot better than it used to.
The Org homepage\footnote{The link is: \url{http://orgmode.org}} now looks a lot better than it used to.

\section{Source code新技术革命}
\label{sec:orgheadline19}
\subsection{osidjfojsdf新技术革命}
\label{sec:orgheadline17}
\subsubsection{{\bfseries\sffamily TODO} soidjfosdjfosd}
\label{sec:orgheadline16}
\begin{enumerate}
\item sdoifjosdjofjosdf
\label{sec:orgheadline15}
\begin{enumerate}
\item oisdjfosjdofjosdof
\label{sec:orgheadline14}
\begin{enumerate}
\item oisdfjosdjofjosdjfo
\label{sec:orgheadline11}
\begin{enumerate}
\item sdifjosjdofjsodfjosd
\label{sec:orgheadline8}
\begin{enumerate}
\item {\bfseries\sffamily TODO} sodifjosjdofjo
\label{sec:orgheadline3}
\item {\bfseries\sffamily TODO} soidfjosjdof
\label{sec:orgheadline4}
\item sidofjosjdofsodjfojsdoifj新技术革命
\label{sec:orgheadline5}

\begin{verbatim}
var a=100;
a+=10;
function abc(){}
\end{verbatim}

\begin{description}
\item[{oidsfj}] sodifjojsdf
\item[{$\square$ fjisdf}] sdoifjosdjofjosdf

\item[{$\boxtimes$ oisdjf}] sodijfoj

\begin{itemize}
\item TODO Organize party [1/4]
\begin{itemize}
\item $\boxminus$ call people [1/2]
\begin{itemize}
\item $\square$ Peter
\item $\boxtimes$ Sarah
\end{itemize}
\item $\square$ order food
\item $\boxminus$ sodijfofisdjof
\begin{itemize}
\item $\boxtimes$ sdfijosdfjoj
\item $\boxtimes$ soidfjo
\item $\square$ 324234
\end{itemize}
\item $\boxtimes$ sdoifjosdjofje
\end{itemize}
\end{itemize}

\item This: \(\alpha\) \(\rightarrow\) \(\beta\)
  soidfjosjdof
\end{description}

\item {\bfseries\sffamily TODO} soidjfosjdf
\label{sec:orgheadline6}
\item oifjosdijfosdf
\label{sec:orgheadline7}
\end{enumerate}
\item sodifjosdjfojsodfj
\label{sec:orgheadline9}
\item {\bfseries\sffamily TODO} soidjfosjdofjo
\label{sec:orgheadline10}
\end{enumerate}
\item foiwejfojweofjoweofwewioefjowe
\label{sec:orgheadline12}
\item {\bfseries\sffamily TODO} soidfjosjdofjosdjf
\label{sec:orgheadline13}
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsection{oidfjoisoidfjosdof}
\label{sec:orgheadline18}
\section{{\bfseries\sffamily TODO} sadoijfoajsdf\hfill{}\textsc{ATTACH}}
\label{sec:orgheadline20}
\begin{itemize}
\item \(O(n \log n)\)
\end{itemize}

\begin{align*}
3 * 2 + &= 6 + 1 \\
        &= 7
\end{align*}
\section{{\bfseries\sffamily TODO} sdifjosjdf}
\label{sec:orgheadline21}
\section{{\bfseries\sffamily TODO} soidfjosjdf}
\label{sec:orgheadline22}
\end{document}